; domain
(define (domain emergencia)
  (:requirements :strips :typing)

  (:types
    location
    person
    crate
    content
    drone
  )

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-crate ?c - crate ?l - location)

    (has-content ?c - crate ?con - content)
    (has ?p - person ?con - content)

    (free-arm1 ?d - drone)
    (free-arm2 ?d - drone)

    (carrying-arm1 ?d - drone ?c - crate)
    (carrying-arm2 ?d - drone ?c - crate)

    (available ?c - crate)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition
      (at-drone ?d ?from)
    :effect
      (and
        (not (at-drone ?d ?from))
        (at-drone ?d ?to)
      )
  )

  (:action pickup-arm1
    :parameters (?d - drone ?c - crate ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-crate ?c ?l)
        (free-arm1 ?d)
        (available ?c)
      )
    :effect
      (and
        (not (at-crate ?c ?l))
        (not (free-arm1 ?d))
        (not (available ?c))
        (carrying-arm1 ?d ?c)
      )
  )

  (:action pickup-arm2
    :parameters (?d - drone ?c - crate ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-crate ?c ?l)
        (free-arm2 ?d)
        (available ?c)
      )
    :effect
      (and
        (not (at-crate ?c ?l))
        (not (free-arm2 ?d))
        (not (available ?c))
        (carrying-arm2 ?d ?c)
      )
  )

  (:action deliver-arm1
    :parameters (?d - drone ?c - crate ?p - person ?con - content ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-person ?p ?l)
        (carrying-arm1 ?d ?c)
        (has-content ?c ?con)
      )
    :effect
      (and
        (not (carrying-arm1 ?d ?c))
        (free-arm1 ?d)
        (has ?p ?con)
      )
  )

  (:action deliver-arm2
    :parameters (?d - drone ?c - crate ?p - person ?con - content ?l - location)
    :precondition
      (and
        (at-drone ?d ?l)
        (at-person ?p ?l)
        (carrying-arm2 ?d ?c)
        (has-content ?c ?con)
      )
    :effect
      (and
        (not (carrying-arm2 ?d ?c))
        (free-arm2 ?d)
        (has ?p ?con)
      )
  )
)

; problem
(define (problem drone_problem_d1_r0_l14_p14_c14_g14_ct2)
(:domain emergencia)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
)
(:init
	(at-drone drone1 depot)
	(free-arm1 drone1)
	(free-arm2 drone1)
	(at-crate crate1 depot)
	(available crate1)
	(at-crate crate2 depot)
	(available crate2)
	(at-crate crate3 depot)
	(available crate3)
	(at-crate crate4 depot)
	(available crate4)
	(at-crate crate5 depot)
	(available crate5)
	(at-crate crate6 depot)
	(available crate6)
	(at-crate crate7 depot)
	(available crate7)
	(at-crate crate8 depot)
	(available crate8)
	(at-crate crate9 depot)
	(available crate9)
	(at-crate crate10 depot)
	(available crate10)
	(at-crate crate11 depot)
	(available crate11)
	(at-crate crate12 depot)
	(available crate12)
	(at-crate crate13 depot)
	(available crate13)
	(at-crate crate14 depot)
	(available crate14)
	(has-content crate1 food)
	(has-content crate2 food)
	(has-content crate3 food)
	(has-content crate4 food)
	(has-content crate5 food)
	(has-content crate6 food)
	(has-content crate7 food)
	(has-content crate8 medicine)
	(has-content crate9 medicine)
	(has-content crate10 medicine)
	(has-content crate11 medicine)
	(has-content crate12 medicine)
	(has-content crate13 medicine)
	(has-content crate14 medicine)
	(at-person person1 loc13)
	(at-person person2 loc10)
	(at-person person3 loc9)
	(at-person person4 loc10)
	(at-person person5 loc5)
	(at-person person6 loc8)
	(at-person person7 loc2)
	(at-person person8 loc10)
	(at-person person9 loc13)
	(at-person person10 loc7)
	(at-person person11 loc6)
	(at-person person12 loc10)
	(at-person person13 loc4)
	(at-person person14 loc5)
)
(:goal (and
	(at-drone drone1 depot)
	(has person1 food)
	(has person2 food)
	(has person2 medicine)
	(has person4 food)
	(has person4 medicine)
	(has person6 food)
	(has person6 medicine)
	(has person8 food)
	(has person8 medicine)
	(has person9 medicine)
	(has person10 medicine)
	(has person12 food)
	(has person14 food)
	(has person14 medicine)
	))
)

; plan
1. (pickup-arm2 drone1 crate14 depot)
   deleted: (at-crate crate14 depot) (free-arm2 drone1) (available crate14)
   added: (carrying-arm2 drone1 crate14)
   goals met: 1 of 15
2. (pickup-arm1 drone1 crate7 depot)
   deleted: (at-crate crate7 depot) (free-arm1 drone1) (available crate7)
   added: (carrying-arm1 drone1 crate7)
   goals met: 1 of 15
3. (fly drone1 depot loc7)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc7)
   goals met: 0 of 15
4. (deliver-arm2 drone1 crate14 person10 medicine loc7)
   deleted: (carrying-arm2 drone1 crate14)
   added: (free-arm2 drone1) (has person10 medicine)
   goals met: 1 of 15
5. (fly drone1 loc7 depot)
   deleted: (at-drone drone1 loc7)
   added: (at-drone drone1 depot)
   goals met: 2 of 15
6. (pickup-arm2 drone1 crate13 depot)
   deleted: (at-crate crate13 depot) (free-arm2 drone1) (available crate13)
   added: (carrying-arm2 drone1 crate13)
   goals met: 2 of 15
7. (fly drone1 depot loc13)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc13)
   goals met: 1 of 15
8. (deliver-arm2 drone1 crate13 person9 medicine loc13)
   deleted: (carrying-arm2 drone1 crate13)
   added: (free-arm2 drone1) (has person9 medicine)
   goals met: 2 of 15
9. (deliver-arm1 drone1 crate7 person1 food loc13)
   deleted: (carrying-arm1 drone1 crate7)
   added: (free-arm1 drone1) (has person1 food)
   goals met: 3 of 15
10. (fly drone1 loc13 depot)
   deleted: (at-drone drone1 loc13)
   added: (at-drone drone1 depot)
   goals met: 4 of 15
11. (pickup-arm2 drone1 crate12 depot)
   deleted: (at-crate crate12 depot) (free-arm2 drone1) (available crate12)
   added: (carrying-arm2 drone1 crate12)
   goals met: 4 of 15
12. (pickup-arm1 drone1 crate6 depot)
   deleted: (at-crate crate6 depot) (free-arm1 drone1) (available crate6)
   added: (carrying-arm1 drone1 crate6)
   goals met: 4 of 15
13. (fly drone1 depot loc10)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc10)
   goals met: 3 of 15
14. (deliver-arm2 drone1 crate12 person2 medicine loc10)
   deleted: (carrying-arm2 drone1 crate12)
   added: (free-arm2 drone1) (has person2 medicine)
   goals met: 4 of 15
15. (fly drone1 loc10 depot)
   deleted: (at-drone drone1 loc10)
   added: (at-drone drone1 depot)
   goals met: 5 of 15
16. (pickup-arm2 drone1 crate11 depot)
   deleted: (at-crate crate11 depot) (free-arm2 drone1) (available crate11)
   added: (carrying-arm2 drone1 crate11)
   goals met: 5 of 15
17. (fly drone1 depot loc10)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc10)
   goals met: 4 of 15
18. (deliver-arm2 drone1 crate11 person4 medicine loc10)
   deleted: (carrying-arm2 drone1 crate11)
   added: (free-arm2 drone1) (has person4 medicine)
   goals met: 5 of 15
19. (fly drone1 loc10 depot)
   deleted: (at-drone drone1 loc10)
   added: (at-drone drone1 depot)
   goals met: 6 of 15
20. (pickup-arm2 drone1 crate10 depot)
   deleted: (at-crate crate10 depot) (free-arm2 drone1) (available crate10)
   added: (carrying-arm2 drone1 crate10)
   goals met: 6 of 15
21. (fly drone1 depot loc10)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc10)
   goals met: 5 of 15
22. (deliver-arm2 drone1 crate10 person8 medicine loc10)
   deleted: (carrying-arm2 drone1 crate10)
   added: (free-arm2 drone1) (has person8 medicine)
   goals met: 6 of 15
23. (fly drone1 loc10 depot)
   deleted: (at-drone drone1 loc10)
   added: (at-drone drone1 depot)
   goals met: 7 of 15
24. (pickup-arm2 drone1 crate9 depot)
   deleted: (at-crate crate9 depot) (free-arm2 drone1) (available crate9)
   added: (carrying-arm2 drone1 crate9)
   goals met: 7 of 15
25. (fly drone1 depot loc10)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc10)
   goals met: 6 of 15
26. (deliver-arm1 drone1 crate6 person2 food loc10)
   deleted: (carrying-arm1 drone1 crate6)
   added: (free-arm1 drone1) (has person2 food)
   goals met: 7 of 15
27. (fly drone1 loc10 depot)
   deleted: (at-drone drone1 loc10)
   added: (at-drone drone1 depot)
   goals met: 8 of 15
28. (pickup-arm1 drone1 crate5 depot)
   deleted: (at-crate crate5 depot) (free-arm1 drone1) (available crate5)
   added: (carrying-arm1 drone1 crate5)
   goals met: 8 of 15
29. (fly drone1 depot loc10)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc10)
   goals met: 7 of 15
30. (deliver-arm1 drone1 crate5 person4 food loc10)
   deleted: (carrying-arm1 drone1 crate5)
   added: (free-arm1 drone1) (has person4 food)
   goals met: 8 of 15
31. (fly drone1 loc10 depot)
   deleted: (at-drone drone1 loc10)
   added: (at-drone drone1 depot)
   goals met: 9 of 15
32. (pickup-arm1 drone1 crate4 depot)
   deleted: (at-crate crate4 depot) (free-arm1 drone1) (available crate4)
   added: (carrying-arm1 drone1 crate4)
   goals met: 9 of 15
33. (fly drone1 depot loc10)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc10)
   goals met: 8 of 15
34. (deliver-arm1 drone1 crate4 person8 food loc10)
   deleted: (carrying-arm1 drone1 crate4)
   added: (free-arm1 drone1) (has person8 food)
   goals met: 9 of 15
35. (fly drone1 loc10 depot)
   deleted: (at-drone drone1 loc10)
   added: (at-drone drone1 depot)
   goals met: 10 of 15
36. (pickup-arm1 drone1 crate3 depot)
   deleted: (at-crate crate3 depot) (free-arm1 drone1) (available crate3)
   added: (carrying-arm1 drone1 crate3)
   goals met: 10 of 15
37. (fly drone1 depot loc10)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc10)
   goals met: 9 of 15
38. (deliver-arm1 drone1 crate3 person12 food loc10)
   deleted: (carrying-arm1 drone1 crate3)
   added: (free-arm1 drone1) (has person12 food)
   goals met: 10 of 15
39. (fly drone1 loc10 depot)
   deleted: (at-drone drone1 loc10)
   added: (at-drone drone1 depot)
   goals met: 11 of 15
40. (pickup-arm1 drone1 crate2 depot)
   deleted: (at-crate crate2 depot) (free-arm1 drone1) (available crate2)
   added: (carrying-arm1 drone1 crate2)
   goals met: 11 of 15
41. (fly drone1 depot loc8)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc8)
   goals met: 10 of 15
42. (deliver-arm2 drone1 crate9 person6 medicine loc8)
   deleted: (carrying-arm2 drone1 crate9)
   added: (free-arm2 drone1) (has person6 medicine)
   goals met: 11 of 15
43. (deliver-arm1 drone1 crate2 person6 food loc8)
   deleted: (carrying-arm1 drone1 crate2)
   added: (free-arm1 drone1) (has person6 food)
   goals met: 12 of 15
44. (fly drone1 loc8 depot)
   deleted: (at-drone drone1 loc8)
   added: (at-drone drone1 depot)
   goals met: 13 of 15
45. (pickup-arm2 drone1 crate8 depot)
   deleted: (at-crate crate8 depot) (free-arm2 drone1) (available crate8)
   added: (carrying-arm2 drone1 crate8)
   goals met: 13 of 15
46. (pickup-arm1 drone1 crate1 depot)
   deleted: (at-crate crate1 depot) (free-arm1 drone1) (available crate1)
   added: (carrying-arm1 drone1 crate1)
   goals met: 13 of 15
47. (fly drone1 depot loc5)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc5)
   goals met: 12 of 15
48. (deliver-arm2 drone1 crate8 person14 medicine loc5)
   deleted: (carrying-arm2 drone1 crate8)
   added: (free-arm2 drone1) (has person14 medicine)
   goals met: 13 of 15
49. (deliver-arm1 drone1 crate1 person14 food loc5)
   deleted: (carrying-arm1 drone1 crate1)
   added: (free-arm1 drone1) (has person14 food)
   goals met: 14 of 15
50. (fly drone1 loc5 depot)
   deleted: (at-drone drone1 loc5)
   added: (at-drone drone1 depot)
   goals met: 15 of 15
